#include"game3.h"

/*学生信息包括：学号，姓名，性别，出生年月，地址，电话，E-mail等。课程信息包括：课程号，课程名称，学分。成绩信息包括：课程号、课程名称、学号、姓名、成绩。
设计学生成绩系统，使之能提供以下功能：
	系统以菜单方式工作
	学生信息维护功能（学生信息用文件保存），实现增删改查等功能
	课程信息维护功能（课程信息用文件保存），实现增删改查等功能
	成绩信息维护功能（成绩信息用文件保存），实现增删改查等功能
	统计分析功能：输入学生学号，打印该学生所有课程成绩，并计算输出平均分
	课程成绩排名功能：输入课程编号，输出成绩排序
	学生平均分排名功能：计算每位学生的平均分，并排序输出

*/


void menu()
{
	printf("*********************************************************\n");
	printf("*********************************************************\n");
	printf("*****************      系统功能菜单      ****************\n");
	printf("*************                                ************\n");
	printf("*************       0.退出系统(自动保存数据) ************\n");
	printf("*************       1.学生信息维护           ************\n");
	printf("*************       2.课程信息维护           ************\n");
	printf("*************       3.成绩信息维护           ************\n");
	printf("*************       4.平均分查询             ************\n");
	printf("*************       5.课程成绩排名查询       ************\n");
	printf("*************       6.平均分排名查询         ************\n");
	printf("*********************************************************\n");
	printf("*********************************************************\n");
	printf("---------------------------------------------------------\n");
	printf("请输入您的选择：\n");
}

int main()
{
	int input = 0;
	Contact con1; //Contact 可类比于int，Contact con1 可类比于 int a
	//初始化 con
	InitContact(&con1);
	Contact2 con2;
	InitContact2(&con2);
	Contact3 con3;
	InitContact3(&con3);
	// 读取已经存在的数据
	Pre_read_main(&con1, &con2, &con3);
	do
	{
		menu();
		scanf_s("%d", &input);
		switch (input)
		{
		case 0: Exit_main(&con1, &con2, &con3); break;
		case 1: Stu_mess_main(&con1); break;
		case 2: Cla_mess_main(&con2); break;
		case 3: Gra_mess_main(&con3); break;
		case 4: Aver_gra_enquire(&con3); break;
		case 5: Cla_gra_rank(&con1,&con3); break;
		case 6: Aver_gra_rank(&con1, &con3); break;
		deflault: printf("选项不存在，请重新选择"); break;
		}
	} while (input);
	
	return 0;
}

